Revit API Introduction Labs
Lab3_4_Form Constructor
Initializes a new instance of the Lab3_4_Form class
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public Lab3_4_Form(
	Dictionary<string, List<FamilySymbol>> dict
)
Visual Basic (Declaration)
Public Sub New ( _
	dict As Dictionary(Of String, List(Of FamilySymbol)) _
)
Visual C++
public:
Lab3_4_Form(
	Dictionary<String^, List<FamilySymbol^>^>^ dict
)
Parameters
dict
Type: System.Collections.Generic.Dictionary<String, List<FamilySymbol>>
See Also
Lab3_4_Form Class
Labs Namespace